#include <iostream>
using namespace std;

int main() {
//===============================================================================
  int count, ref ,elements[count],k=0; //Определяем переменную отвечающую за кол-вэлементов массива, переменную которая сохраняет в себе значение элемента, определяем массив
  
  cout <<"Введите кол-во элементов массива:\n"; 
  cin >> count; //Вводим кол-во элементов массива
  cout << "Введите " << count << " элементов:\n";
//=========================Цикл заполнения массива===============================
  for (int i=0; i<count;i++){ 
    cout<<i<<" элемент:";
    cin>>ref;
    elements[i]=ref;
    }
//=========================Цикл проверки массива=================================
  for (int i=1; i<count;i++){ 
    if (elements[i-1]>elements[i]){
      k++;
      }
    }
    if (k>0)
      cout<<"Не образуется";
    else
      cout<<"Образуется";
//===============================================================================
}
