#include <iostream>
#include <cmath>

using namespace std;

int main() {
//=======================================================================
  int i,n,x,y; //Определяем переменную для координат, кол-во окружностей
  double rad, rmin = 0; //Определяем переменные для сравнение радиусов
  cout << "Введите кол-во окружностей: ";
  cin >> n;
//======================Цикл для вычесления минимального радиуса=========
  cout << "Введите координаты для: \n";
  for(i = 0; i < n; i ++){
    cout << "x["<<i<<"]:"; cin >> x;
    cout << "y["<<i<<"]:"; cin >> y;
    rad = sqrt(x*x+y*y);
    if (rad > rmin){rmin = rad;}
  }
//=========================================================================
    cout <<"Минимальный радиус:"<<rmin;
}