#include <iostream>
using namespace std;

int main() {
//===============================================================================
  int count, ref ,elements[count]; //Определяем переменную отвечающую за кол-вэлементов массива, переменную которая сохраняет в себе значение элемента, определяем массив
  cout <<"Введите кол-во элементов массива:\n"; 
  cin >> count; //Вводим кол-во элементов массива
  cout << "Введите " << count << " элементов:\n";
//=========================Цикл заполнения массива===============================
  for (int i=1; i<=count;i++)
  {cin>>ref; elements[i]=ref; cout<<i<<" элемент:"<<elements[i]<<"\n";}
//=========================Цикл проверки массива=================================
  for (int i=1; i<=count;i++)
  { 
    if (elements[i]>=elements[i+1]){cout<<"Не образуется";break;}
    else{cout<<"Образуется";} 
  }
//===============================================================================
}
